<a href="https://colab.research.google.com/github/yusufbek-murodov/mohirdev_data_science_course/blob/main/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Series ma'lumotlar tuzilmasi

In [10]:
import pandas as pd
import numpy as np # kutubxonalrni yuklash

In [11]:
from pandas import Series
# Pandasda ikkita ma'lumotlas tuzilmasi mavjud
# birinchisi: Series ma'lumotlar tuzilmasi
# ikkinchisi: DataFrame ma'lumotlar tuzilmasi

In [12]:
obj = Series([4, 5, 6, -6.5]) # Series orqali object yaratamiz

In [13]:
type(obj) # objectni type ni ko'rish

pandas.core.series.Series

In [14]:
print(obj) # objectni chop etamiz

0    4.0
1    5.0
2    6.0
3   -6.5
dtype: float64

In [15]:
obj.values # objni qiymatlarini ko'ramiz

array([ 4. ,  5. ,  6. , -6.5])

In [16]:
obj.index # objni indexlarini ko'ramiz

RangeIndex(start=0, stop=4, step=1)

In [17]:
obj[0] # 0-indexdagi ma'lumotni olamiz

4.0

In [18]:
obj2 = Series([6, 3, 2, 1], index=['a', 'b', 'c', 'd']) # Object yasab olamiz va unga o'zimiz index beramiz

In [19]:
obj2

a    6
b    3
c    2
d    1
dtype: int64

In [20]:
obj2['a'] # objni indexi orqali chaqirish

6

In [21]:
obj2[['a', 'b', 'd']]

a    6
b    3
d    1
dtype: int64

In [22]:
obj2[obj2 > 2] # 2 dan katta bo'lgan objectning qiymatlarini chiqaramiz

a    6
b    3
dtype: int64

In [23]:
obj2 * 2 # objni qiymatlarini 2 ga ko'paytiramiz

a    12
b     6
c     4
d     2
dtype: int64

In [24]:
obj2

a    6
b    3
c    2
d    1
dtype: int64

In [25]:
np.exp(obj2)

a    403.428793
b     20.085537
c      7.389056
d      2.718282
dtype: float64

Lug'atdan Series yaratish

In [26]:
cars_dict = {'Malibu': 40000, 'Lacetti': 20000, 'Toyota': 45000, 'Mazda': 52000, 'Honda': 38000} # lug'at yasab olamiz

In [27]:
type(cars_dict) # lug'atni typeni ko'ramiz

dict

In [28]:
cars1 = Series(cars_dict) # lug'atdan Series ma'lumot tuzilmasi yasab olamiz

In [29]:
cars1

Malibu     40000
Lacetti    20000
Toyota     45000
Mazda      52000
Honda      38000
dtype: int64

In [30]:
'Malibu' in cars1

True

In [31]:
'BMW' in cars1

False

In [32]:
cars_dict

{'Malibu': 40000,
 'Lacetti': 20000,
 'Toyota': 45000,
 'Mazda': 52000,
 'Honda': 38000}

In [33]:
models = ['Honda', 'Mazda', 'Lacetti', 'Jaguar', 'Malibu', 'Toyota', 'BMW', 'Mercedes'] # avtomobillarning modellaridan iborat lug'at yasab olamiz

In [34]:
cars2 = Series(cars_dict, index=models) # modelda bor indexlar cars2 dagi indexlarga tushadi va qiymatini oladi yo'qlari esa NAN bo'ladi

In [35]:
cars2

Honda       38000.0
Mazda       52000.0
Lacetti     20000.0
Jaguar          NaN
Malibu      40000.0
Toyota      45000.0
BMW             NaN
Mercedes        NaN
dtype: float64

Series methodlari

In [36]:
# Keyinchalik, ma'lumotlar bilan ishlaganda NaN qiymatlarini ajratish muhim ahamiyatga ega. Buning uchun Series bir mahsus methodlarga ega.

In [37]:
cars2.isnull() # qiymat null (mavjud emasligini) tekshirish uchun

Honda       False
Mazda       False
Lacetti     False
Jaguar       True
Malibu      False
Toyota      False
BMW          True
Mercedes     True
dtype: bool

In [38]:
cars2.notnull() # qiymat (null) emasligini (mavjud) tekshiradi

Honda        True
Mazda        True
Lacetti      True
Jaguar      False
Malibu       True
Toyota       True
BMW         False
Mercedes    False
dtype: bool

In [39]:
# Series obyektining muhim jihatlaridan biri, ikkita series obyektini qo'shishda (ayirishda) qiymatlar indeks bo'yicha qo'shiladi

In [44]:
new_prices = Series({'Honda':5000, 'Mazda':-3000, 'Malibu':4500, 'Toyota':5200, 'Lacetti':-1200})

In [45]:
new_prices

Honda      5000
Mazda     -3000
Malibu     4500
Toyota     5200
Lacetti   -1200
dtype: int64

In [46]:
cars2+new_prices

BMW             NaN
Honda       43000.0
Jaguar          NaN
Lacetti     18800.0
Malibu      44500.0
Mazda       49000.0
Mercedes        NaN
Toyota      50200.0
dtype: float64

In [47]:
# Series obyektining o'zini ham indekslarini ham nomlash mumkin.

In [48]:
cars2.name = 'Avtosalon'

In [49]:
cars2.index.name = 'Car Model'

In [50]:
cars2

Car Model
Honda       38000.0
Mazda       52000.0
Lacetti     20000.0
Jaguar          NaN
Malibu      40000.0
Toyota      45000.0
BMW             NaN
Mercedes        NaN
Name: Avtosalon, dtype: float64

# Series obyektiga oid ba'zi parametrlar va metodlar

In [51]:
cars2.index # indekslar

Index(['Honda', 'Mazda', 'Lacetti', 'Jaguar', 'Malibu', 'Toyota', 'BMW',
       'Mercedes'],
      dtype='object', name='Car Model')

In [53]:
cars2.values # qiymatlar

array([38000., 52000., 20000.,    nan, 40000., 45000.,    nan,    nan])

In [54]:
cars2.hasnans # NaN qiymatlar bor (True) yo'qligi (False)

True

In [56]:
cars2.dtype # qiymatlarning ma'lumot turi

dtype('float64')

In [57]:
cars2.is_unique # qiymatlar takrorlanmas ekanini tekshirish

False

In [58]:
cars2.shape # Series hajmi

(8,)

In [66]:
cars2.iloc[2] # indeks bo'yicha murojaat qilish

20000.0

In [67]:
cars2

Car Model
Honda       38000.0
Mazda       52000.0
Lacetti     20000.0
Jaguar          NaN
Malibu      40000.0
Toyota      45000.0
BMW             NaN
Mercedes        NaN
Name: Avtosalon, dtype: float64

In [68]:
cars2['Honda']

38000.0

In [69]:
cars2.loc['Toyota'] # ma'lumotlarga indeks bo'yicha murojaat qilish

45000.0

In [71]:
cars2.max() # max qiymat

52000.0

In [73]:
cars2.min() # min qiymat

20000.0

In [75]:
cars2.mean() # o'rtacha qiymat

39000.0